swak4foam/Examples/PythonIntegration/findPointPitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs (
    "libswakPythonIntegration.so"
);

functions (
    adaptRelaxation
    {
        type pythonFluIntegration;
        startFile "$FOAM_CASE/startFindPoint.py";
        executeFile "$FOAM_CASE/executeFindPoint.py";
        endFile "$FOAM_CASE/endFindPoint.py";
        parallelMasterOnly false;
        //        interactiveAfterExecute true;
        //        interactiveAfterException true;
    }
);

// ************************************************************************* //
